Repository: Suven/astro-po-i18n
Catalog: locales/*.po
Languages: de, es

source: The alternate way of translating Astro
de: Die alternative Art der Übersetzung von Astro

source: With this skeleton for astro, you can jumpstart an multilingual site that is translated via standard gettext and <code>.po</code> files.
de: Mit diesem Blueprint für Astro kannst du eine mehrsprachige Website erstellen, die über Standard-Gettext- und <code>.po-Dateien</code> übersetzt wird.
es: Con este esqueleto para astro, puedes poner en marcha un sitio multilingüe que se traduzca mediante archivos gettext y <code>.po</code> estándar.

source: This approach has many advantages, as well as some disadvantages when compared to astros default approach to i18n:
de: Dieser Ansatz hat viele Vorteile, aber auch einige Nachteile im Vergleich zu Astros Standardansatz für i18n:
es: Este enfoque tiene muchas ventajas, así como algunas desventajas en comparación con el enfoque por defecto de astros para i18n:

source: Write your content/astro-files only once instead one per translation
de: Schreibe deine Inhalte/Astrodateien nur einmal, statt eine pro Übersetzung
es: Escribe tus contenidos/archivos astrológicos una sola vez en lugar de una por traducción

source: Translators can handle the format even without dev knowladge
de: Übersetzer können das Format auch ohne Entwicklungskenntnisse handhaben
es: Los traductores pueden manejar el formato incluso sin conocimientos de desarrollo

source: You can use services like crowdin to let users translate
de: Du kannst Dienste wie Crowdin nutzen, um Nutzer übersetzen zu lassen
es: Puedes utilizar servicios como crowdin para que los usuarios traduzcan

source: Poedit enables you to translate with AI
de: Poedit ermöglicht es dir, mit KI zu übersetzen
es: Poedit te permite traducir con IA

source: Warns you about missing translations
de: Warnt dich vor fehlenden Übersetzungen
es: Te avisa de las traducciones que faltan

source: Builds all translations at once
de: Erstellt alle Übersetzungen auf einmal
es: Construye todas las traducciones a la vez

source: Previews only one translation at a time
de: Zeigt immer nur eine Übersetzung auf einmal an
es: Previsualiza sólo una traducción a la vez

source: no translatable URLs
de: keine übersetzbaren URLs
es: sin URL traducibles

source: no support for SSR. This is SSG only
de: keine Unterstützung für SSR. Nur SSG wird unterstützt
es: no es compatible con SSR. Esto es sólo SSG

source: 1. Install
de: 1. Setup
es: 1. Instala

source: Just run these two commands, to receive this basic skeleton:
de: Führe einfach diese beiden Befehle aus, um dieses Grundgerüst zu erhalten:
es: Sólo tienes que ejecutar estos dos comandos, para recibir este esqueleto básico:

source: 2. Adjust your setup
de: 2. Passe dein Setup an
es: 2. Ajusta tu configuración

source: Specify which languages you wish to support and which is your main one, within <code><tt>utils/i18n.js</tt></code>:
de: Gib in <code><tt>utils/i18n.js</tt></code> an, welche Sprachen du unterstützen möchtest und welche deine Hauptsprache ist:
es: Especifica qué idiomas deseas admitir y cuál es el principal, dentro de <code><tt>utils/i18n.js</tt></code>:

source: For SEO-safety you are also advised to configure your final domain within <code><tt>astro.config.mjs</tt></code>:
de: Aus Gründen der SEO-Sicherheit wird außerdem empfohlen, die endgültige Domain in <code><tt>astro.config.mjs</tt></code> anzugeben:
es: Por seguridad SEO, también se recomienda configurar el dominio final en <code><tt>astro.config.mjs</tt></code>:

source: You might also want to delete all already shipped translations
de: Vielleicht möchtest du auch alle bereits versendeten Übersetzungen löschen
es: Puede que también quieras borrar todas las traducciones ya enviadas

source: 3. Place your texts
de: 3. Platziere deine Texte
es: 3. Coloca tus textos

source: There are two workflow flavours in the gettext-communities. The common way is to just place your texts in your main language (commonly english) directly within your templates. That way you are not using keys and give translators a better context of what you want to be translated. It also makes sure that your main language is always fully translated.
de: In den gettext-Communities gibt es zwei Arten von Arbeitsabläufen. Der übliche Weg ist, dass du deine Texte in deiner Hauptsprache (normalerweise Englisch) direkt in deinen Vorlagen platzierst. Auf diese Weise verwendest du keine IDs und gibst den Übersetzern einen besseren Überblick darüber, was übersetzt werden soll. Außerdem stellst du so sicher, dass deine Hauptsprache immer vollständig übersetzt ist.
es: Hay dos tipos de flujo de trabajo en las comunidades gettext. La forma más común es colocar tus textos en tu idioma principal (normalmente inglés) directamente dentro de tus plantillas. De esta forma no utilizas claves y das a los traductores un mejor contexto de lo que quieres traducir. También te aseguras de que tu idioma principal esté siempre totalmente traducido.

source: The other approach uses keys, that then first need to be translated into your main language. It leaves your content responsible colleagues more freedom but makes it harder for translators. It also comes with the disadvantage that you might overlook to translate content, when the main translation changed its meaning.
de: Der andere Ansatz verwendet IDs, die dann erst in deine Hauptsprache übersetzt werden müssen. Das lässt deinen für den Inhalt verantwortlichen Kolleginnen und Kollegen mehr Freiheit, macht es aber für die Übersetzer schwieriger. Außerdem hat es den Nachteil, dass du vielleicht übersiehst, Inhalte zu übersetzen, wenn die Hauptübersetzung ihre Bedeutung verändert hat.
es: El otro enfoque utiliza claves, que luego hay que traducir primero a tu lengua principal. Deja más libertad a tus colegas responsables de contenidos, pero se lo pone más difícil a los traductores. También tiene la desventaja de que puedes pasar por alto traducir el contenido, cuando la traducción principal haya cambiado su significado.

source: The first approach of using direct translations, is more often advised to be used.
de: Der erste Ansatz, nämlich direkte Übersetzungen zu verwenden, wird häufiger empfohlen.
es: Se aconseja utilizar más a menudo el primer enfoque, que consiste en utilizar traducciones directas.

source: Direct placing
de: Direktplatzierung
es: Colocación directa

source: Example
de: Beispiel
es: Ejemplo

source: Keyed placing
de: ID-basierte Platzierung
es: Colocación con llave

source: 3b. Placing links
de: 3b. Links platzieren
es: 3b. Colocación de enlaces

source: This skeleton also comes with a helper to place localized links within your project.
de: Dieses Template enthält auch einen Helfer, mit dem du lokalisierte Links in deinem Projekt platzieren kannst.
es: Este esqueleto también viene con un ayudante para colocar enlaces localizados dentro de tu proyecto.

source: Link to /about while staying in the current language
de: Link zu /about in der aktuellen Sprache
es: Enlazar a /acerca de permaneciendo en la lengua actual

source: Link to the english version of /about
de: Link zur englischen Version von /about
es: Enlace a la versión en inglés de /about

source: Link to the english version of /about including the full domain
de: Link zur englischen Version von /about einschließlich der vollständigen Domain
es: Enlace a la versión en inglés de /about incluyendo el dominio completo

source: This is just an example subpage. Content might follow.
de: Dies ist nur eine Beispiel-Unterseite. Der Inhalt könnte folgen.
es: Esto es sólo una subpágina de ejemplo. El contenido puede seguir.

source: SEO-Safe
es: SEO-Seguro
